Repository: HeemTempo/v2
Catalog: lib/l10n/app_*.arb
Languages: sw

# version
source: Version 1.0.0
sw: Toleo 1.0.0

# splashTagline
source: Connecting Communities
sw: Kuunganisha Jamii

# termsPrivacyTitle
source: Terms & Privacy Policy
sw: Masharti & Sera ya Faragha

source: Terms of Service
sw: Masharti ya Huduma

source: Privacy Policy
sw: Sera ya Faragha

# termsContent
source: Welcome to OpenSpace, a platform dedicated to enhancing community engagement through reporting issues and booking public spaces. By using OpenSpace, you agree to the following terms ...
sw: Karibu OpenSpace, jukwaa lililoundwa kuboresha ushirikiano wa jamii kupitia kuripoti matatizo na kuhifadhi nafasi za umma. Kwa kutumia OpenSpace, unakubaliana na masharti yafuatayo ...

# privacyContent
source: At OpenSpace, we prioritize your privacy and adhere to Tanzania’s Personal Data Protection Act, 2022...
sw: Katika OpenSpace, tunazingatia faragha yako na tunafuata Sheria ya Ulinzi wa Data Binafsi ya Tanzania, 2022...

# effectiveDate
source: Effective Date: 30 July 2025
sw: Tarehe ya Kuanzia: 30 Julai 2025

source: Accept and Return
sw: Kubali na Rudi

source: Welcome back
sw: Karibu tena

# signInSubtitle
source: Please enter your credentials to sign in
sw: Tafadhali ingiza taarifa zako kuingia

# usernameLabel
source: Username
sw: Jina la Mtumiaji

# usernameHint
source: Enter your username
sw: Ingiza jina lako la mtumiaji

# passwordLabel
source: Password
sw: Nenosiri

source: Remember me
sw: Nikumbuke

source: Forgot password?
sw: Umesahau nenosiri?

# signInButton
source: Sign in
sw: Ingia

# dontHaveAccount
source: Don't have an account? Create account
sw: Huna akaunti? Unda akaunti

# loginSuccess
source: Successfully Logged In!
sw: Umeingia kwa mafanikio!

# loginFailed
source: Login failed. Please check your credentials.
sw: Kuingia kumeshindikana. Tafadhali hakikisha taarifa zako.

# createAccountTitle
source: Create Account
sw: Unda Akaunti

# signUpSubtitle
source: Please enter your details to sign up
sw: Tafadhali jaza maelezo yako kujiandikisha

# emailLabel
source: Email address
sw: Anwani ya Barua Pepe

# emailHint
source: Enter your email
sw: Ingiza barua pepe yako

# wardLabel
source: Select Ward
sw: Chagua Kata

# passwordConfirmLabel
source: Confirm Password
sw: Thibitisha Nenosiri

# agreeTerms
source: I agree with Terms and Privacy
sw: Ninakubaliana na Masharti na Sera ya Faragha

# signUpButton
source: Sign Up
sw: Jisajili

# alreadyHaveAccount
source: Already have an account? Sign In
sw: Tayari una akaunti? Ingia

# signUpSuccess
source: Registered successfully! Please sign in.
sw: Umejisajili kwa mafanikio! Tafadhali ingia.

# signUpErrorAgree
source: You must agree to the Terms and Privacy
sw: Lazima ukubaliane na Masharti na Sera ya Faragha

# emailRequired
source: Email is required
sw: Barua pepe inahitajika

# emailInvalid
source: Enter a valid email
sw: Weka barua pepe sahihi

# wardRequired
source: Ward is required
sw: Kata inahitajika

# passwordMinLength
source: Password must be at least 8 characters
sw: Nenosiri lazima liwe angalau herufi 8

# passwordConfirmRequired
source: Please confirm your password
sw: Tafadhali thibitisha nenosiri lako

source: Passwords do not match
sw: Manenosiri hayalingani

source: Dashboard
sw: Dashibodi

# notificationsTitle
source: Notifications
sw: Arifa

source: My Profile
sw: Profaili Yangu

source: Help & FAQs
sw: Msaada & Maswali Yanayoulizwa Mara kwa Mara

source: Terms & Conditions
sw: Masharti & Masharti

# privacyPolicyMenu
source: Privacy Policy
sw: Sera ya Faragha

# rateApp
source: Rate This App
sw: Pima Programu Hii

source: About
sw: Kuhusu

source: Settings
sw: Mipangilio

source: Sign Out
sw: Toka

source: Report Issue
sw: Ripoti Tatizo

# reportIssueSubtitle
source: Submit concerns about open spaces
sw: Wasilisha mashida kuhusu nafasi za umma

source: View Reports
sw: Angalia Ripoti

# viewReportsSubtitle
source: Check status of reported issues
sw: Angalia hali ya matatizo yaliyoripotiwa

source: Book Space
sw: Hifadhi Nafasi

# bookSpaceSubtitle
source: Reserve an open space
sw: Hifadhi nafasi ya umma

source: Track Progress
sw: Fuatilia Maendeleo

# trackProgressSubtitle
source: Monitor community improvements
sw: Fuatilia maboresho ya jamii

source: Quick Stats
sw: Takwimu Haraka

source: Open Spaces
sw: Nafasi Za Umma

source: Active Reports
sw: Ripoti Zilizoko Hai

source: Bookings
sw: Hifadhi

source: Quick Actions
sw: Vitendo Haraka

source: Recent Activities
sw: Shughuli Za Karibuni

source: New report submitted
sw: Ripoti mpya imetumwa

source: Space booked
sw: Nafasi imetolewa

source: Issue resolved
sw: Tatizo limekwisha kutatuliwa

source: Emergency Contacts
sw: Mawasiliano ya Dharura

source: Police
sw: Polisi

source: Fire
sw: Moto

source: Ambulance
sw: Ambulensi

source: Close
sw: Funga

# heroTitle1
source: Kinondoni Open Spaces
sw: Nafasi Za Umma Kinondoni

# heroTitle2
source: Community Gardens
sw: Bustani za Jamii

# heroTitle3
source: Public Parks & Recreation
sw: Hadi za Burudani & Hadi za Umma

# heroTitle4
source: Urban Green Spaces
sw: Nafasi za Kijani Mjini

# heroSubtitle1
source: Building stronger communities together
sw: Kujenga jamii imara pamoja

# heroSubtitle2
source: Growing together as one community
sw: Kukua pamoja kama jamii moja

# heroSubtitle3
source: Fun for families and friends
sw: Burudani kwa familia na marafiki

# heroSubtitle4
source: Nature in the heart of the city
sw: Asili katikati ya jiji

# mapScreenAppBar
source: Kinondoni Open Spaces Map
sw: Ramani ya Nafasi Za Umma

# searchHint
source: Search public open space
sw: Tafuta nafasi za umma

# latitudeLabel
source: Latitude
sw: Upana

# longitudeLabel
source: Longitude
sw: Mrefu

source: Open Space Details
sw: Maelezo ya Nafasi

# amenitiesLabel
source: Amenities
sw: Vifaa

# getDirectionsButton
source: Get Directions
sw: Pata Maelekezo

# bookNowButton
source: Book Now
sw: Hifadhi Sasa

# reportButton
source: Report
sw: Ripoti

# cancelButton
source: Cancel
sw: Ghairi

source: Unknown Area
sw: Eneo lisilojulikana

# noSpaceSelected
source: No space selected for booking.
sw: Hakuna nafasi iliyochaguliwa kwa hifadhi.

# spaceNotAvailable
source: This space is currently not available for booking.
sw: Nafasi hii kwa sasa haipatikani kwa hifadhi.

# pinpointedNotPublic
source: Pinpointed area is not a Public open space
sw: Eneo lililotambuliwa si Nafasi ya Umma

# unableFetchLocation
source: Unable to fetch location.
sw: Haiwezi kupata eneo.

source: Location error
sw: Hitilafu ya eneo

# directionsError
source: Unable to fetch your current location.
sw: Haiwezi kupata eneo lako la sasa.

# distanceInfo
source: Directions to {area}: Straight-line distance: {distance} km. (Implement a directions API for detailed navigation.)
sw: Maelekezo ya {area}: Umbali wa mstari wa moja kwa moja: {distance} km. (Tumia API ya maelekezo kwa urambazaji wa kina.)

# reportPageTitle
source: OpenSpace Report
sw: Ripoti ya OpenSpace

# reportHeader
source: Report unused or underutilized public spaces in your community
sw: Ripoti nafasi zisizotumika au zisizotumika vizuri katika jamii yako

# locationDetailsTitle
source: Location Details
sw: Maelezo ya Eneo

# spaceNameLabel
source: Space Name
sw: Jina la Nafasi

# districtLabel
source: District
sw: Wilaya

# coordinatesLabel
source: Coordinates
sw: Kuratibu

# yourInfoTitle
source: Your Information
sw: Taarifa Zako

# phoneLabel
source: Phone Number (Optional)
sw: Nambari ya Simu (Hiari)

# issueDescriptionTitle
source: Issue Description
sw: Maelezo ya Tatizo

# issueDescriptionHint
source: Please provide a clear description of the issue you've observed...
sw: Tafadhali toa maelezo wazi ya tatizo uliloliona...

# attachmentsTitle
source: Attachments
sw: Viongezi

# attachmentsHint
source: Add photos or documents to support your report (max 5 files)
sw: Ongeza picha au nyaraka kusaidia ripoti (max faili 5)

# addPhotosButton
source: Add Photos
sw: Ongeza Picha

# addDocumentsButton
source: Add Documents
sw: Ongeza Nyaraka

# reportGuidelinesTitle
source: Reporting Guidelines
sw: Mwongozo wa Kuripoti

# guideline1
source: Provide accurate details to assist government officials.
sw: Toa maelezo sahihi kusaidia maafisa wa serikali.

# guideline2
source: Avoid duplicate reports; check existing submissions.
sw: Epuka kuripoti mara mbili; angalia ripoti zilizopo.

# guideline3
source: Submit issues that benefit the public (e.g., infrastructure, safety).
sw: Wasilisha matatizo yanayounga mkono umma (mfano: miundombinu, usalama).

# guideline4
source: Attach clear evidence (photos, documents) if available.
sw: Ambatanisha ushahidi wazi (picha, nyaraka) ikiwa upo.

# submitReportButton
source: Submit Report
sw: Tuma Ripoti

# submittingLabel
source: Submitting...
sw: Inatuma...

# reportSubmittedMessage
source: Report submitted successfully!
sw: Ripoti imetumwa kwa mafanikio!

# bookingPageTitle
source: Book Community Space
sw: Hifadhi Nafasi ya Jamii

# bookingHeader
source: Booking Details
sw: Maelezo ya Hifadhi

# fullNameLabel
source: Full Name *
sw: Jina Kamili *

# phoneBookingLabel
source: Phone Number *
sw: Nambari ya Simu *

# emailBookingLabel
source: Email Address (Optional)
sw: Barua Pepe (Hiari)

# spaceDistrictLabel
source: Space Name / District *
sw: Jina la Nafasi / Wilaya *

# startDateLabel
source: Start Date *
sw: Tarehe ya Kuanzia *

# endDateLabel
source: End Date
sw: Tarehe ya Mwisho

# startTimeLabel
source: Start Time *
sw: Muda wa Kuanzia *

# endTimeLabel
source: End Time *
sw: Muda wa Mwisho *

# activitiesLabel
source: Activities Planned *
sw: Shughuli Zilizopangwa *

# submitBookingButton
source: Submit Booking Request
sw: Tuma Ombi la Hifadhi

# bookingTermsTitle
source: Booking Terms
sw: Masharti ya Hifadhi

# bookingTerm1
source: Bookings are subject to availability
sw: Hifadhi zinategemea upatikanaji

# bookingTerm2
source: Please arrive on time for your scheduled slot
sw: Tafadhali fika kwa wakati uliopangwa

# bookingTerm3
source: Cancellations must be made at least 24 hours in advance
sw: Futio lazima lifanyike angalau masaa 24 mapema

# bookingTerm4
source: Keep the space clean and follow all facility rules
sw: Hifadhi eneo safi na fuata sheria zote za huduma

# reportedIssuesTitle
source: Reported Issues
sw: Matatizo Yaliyoripotiwa

# noIssuesMessage
source: No issues reported yet.
sw: Hakuna matatizo yaliyoripotiwa.

# viewMapLabel
source: View Map
sw: Angalia Ramani

# statusResolved
source: Resolved
sw: Imetatuliwa

# statusPending
source: Pending
sw: Inasubiri

# statusRejected
source: Rejected
sw: Imekataliwa

# statusUnknown
source: Unknown
sw: Haijulikani

# profileTitle
source: Profile
sw: Profaili

# profileNoLogin
source: Please log in to view your profile.
sw: Tafadhali ingia kuona profaili yako.

# profileFailedLoad
source: Failed to load profile
sw: Imeshindikana kupakia profaili

# profileNoData
source: No profile data available.
sw: Hakuna data ya profaili.

source: Fetch Profile
sw: Pakia Profaili

# sessionExpired
source: Session expired or invalid. Please log in again.
sw: Kikao kimeisha au si sahihi. Tafadhali ingia tena.

# generalSection
source: GENERAL
sw: KAWAIDA

# activitySection
source: ACTIVITY
sw: SHUGHULI

source: Profile Settings
sw: Mipangilio ya Profaili

# profileSettingsSubtitle
source: Update and modify your profile
sw: Sasisha na badilisha profaili yako

source: Privacy
sw: Faragha

# privacySubtitle
source: Change your password
sw: Badilisha nenosiri

# privacyPopupTitle
source: Privacy Settings
sw: Mipangilio ya Faragha

# privacyPopupMessage
source: Password change feature coming soon!
sw: Kipengele cha kubadilisha nenosiri kitatokea hivi karibuni!

# privacyPopupButton
source: Got it!
sw: Sawa!

source: My Reports
sw: Ripoti Zangu

# myReportsSubtitle
source: View and manage your reports
sw: Angalia na usimamishe ripoti zako

source: My Bookings
sw: Hifadhi Zangu

# myBookingsSubtitle
source: View and manage your bookings
sw: Angalia na usimamishe hifadhi zako

# editProfileTitle
source: Edit Profile
sw: Hariri Profaili

# tapChangePhoto
source: Tap to change profile photo
sw: Gusa kubadilisha picha ya profaili

source: Personal Information
sw: Taarifa Binafsi

source: Name
sw: Jina

# enterName
source: Enter your name
sw: Weka jina lako

# emailInput
source: Email
sw: Barua Pepe

# enterEmail
source: Enter your email
sw: Weka barua pepe yako

source: Phone Number
sw: Nambari ya Simu

# enterPhoneNumber
source: Enter your phone number
sw: Weka nambari yako ya simu

# passwordInput
source: Password
sw: Nenosiri

# enterPassword
source: Enter new password
sw: Weka nenosiri jipya

source: Save Changes
sw: Hifadhi Mabadiliko

# profileUpdatedSuccess
source: Profile updated successfully!
sw: Profaili imesasishwa kwa mafanikio!

# settingsTitle
source: Settings
sw: Mipangilio

source: Change Language
sw: Badilisha Lugha

source: Theme
sw: Mandhari

source: Notification Settings
sw: Mipangilio ya Arifa

# resetPasswordTitle
source: Reset Password
sw: Weka Nenosiri Jipya

# resetPasswordInstruction
source: Enter your new password below.
sw: Ingiza nenosiri jipya hapa chini.

# resetPasswordNewPassword
source: New Password
sw: Nenosiri Jipya

# resetPasswordConfirmPassword
source: Confirm New Password
sw: Thibitisha Nenosiri Jipya

# resetPasswordSubmitButton
source: Set New Password
sw: Weka Nenosiri Jipya

# resetPasswordSuccessMessage
source: {message} You can now log in with your new password.
sw: {message} Sasa unaweza kuingia na nenosiri jipya.

# resetPasswordErrorMessageEmptyPassword
source: Please enter a new password
sw: Tafadhali ingiza nenosiri jipya

# resetPasswordErrorMessageShortPassword
source: Password must be at least 8 characters long
sw: Nenosiri lazima liwe na angalau herufi 8

# resetPasswordErrorMessageConfirmEmpty
source: Please confirm your new password
sw: Tafadhali thibitisha nenosiri jipya

# resetPasswordErrorMessageMismatch
source: Passwords do not match
sw: Nenosiri hazilingani

# themeTitle
source: Choose Theme
sw: Chagua Mandhari

# themeLightMode
source: Light Mode
sw: Mandhari Angavu

# themeDarkMode
source: Dark Mode
sw: Mandhari Nyeusi

source: English
sw: Kiingereza

# userTypeTitle
source: Join OpenSpace
sw: Jiunge na OpenSpace

# userTypeDescription
source: Sign in to track your reports and bookings, or continue anonymously to explore open spaces.
sw: Ingia kufuatilia taarifa zako na nafasi ulizohifadhi, au endelea kama mgeni kuchunguza maeneo ya wazi.

# signInRegisteredButton
source: Sign In as Registered User
sw: Ingia kama Mtumiaji Aliyesajiliwa

# continueAnonymousButton
source: Continue as Anonymous
sw: Endelea kama Mgeni

# termsPrivacyButton
source: Terms & Privacy Policy
sw: Masharti na Sera ya Faragha

# onboardingTitle1
source: Report Issues
sw: Ripoti Changamoto

# onboardingDescription1
source: Easily report unusual activities in open spaces to keep your community safe.
sw: Ripoti haraka matukio yasiyo ya kawaida katika maeneo ya wazi ili kulinda jamii yako.

# onboardingTitle2
source: Book Spaces
sw: Weka Nafasi

# onboardingDescription2
source: Reserve open spaces for community events or personal use with a few taps.
sw: Weka nafasi katika maeneo ya wazi kwa ajili ya shughuli za kijamii au binafsi kwa urahisi.

# skipButton
source: Skip
sw: Ruka

# backButton
source: Back
sw: Nyuma

# nextButton
source: Next
sw: Mbele

source: Search
sw: Tafuta

source: Enter Reference ID
sw: Weka Kitambulisho cha Marejeo

# enterReferenceIdHint
source: Enter Reference ID...
sw: Weka Kitambulisho cha Marejeo...

# enterReferenceIdPrompt
source: Enter a Reference ID and click Search to view report details.
sw: Weka Kitambulisho cha Marejeo na bonyeza Tafuta ili kuona maelezo ya ripoti.

# enterReferenceIdError
source: Please enter a Reference ID
sw: Tafadhali ingiza Kitambulisho cha Marejeo

# noReportFound
source: No report found for Reference ID: {refId}
sw: Hakuna ripoti iliyo patikana kwa Kitambulisho cha Marejeo: {refId}

# notAvailable
source: N/A
sw: Haipo

source: Anonymous User
sw: Mtumiaji Asiyefahamika

# attachmentViewNotImplemented
source: Attachment viewing not yet implemented
sw: Kuangalia nyongeza bado hakutekezwa

# noAttachments
source: No attachments provided.
sw: Hakuna nyongeza zilizotolewa.

source: Description
sw: Maelezo

source: Attachments
sw: Nyongeza

source: Location
sw: Eneo

source: Report ID
sw: Kitambulisho cha Ripoti

source: Active Bookings
sw: Miombaji Inayoendelea

source: Past Bookings
sw: Miombaji ya Zamani

source: Pending Bookings
sw: Miombaji Inayosubiri

# noBookingsMessage
source: No bookings found.
sw: Hakuna miombaji iliyopatikana.

source: Status
sw: Hali

source: Contact
sw: Mawasiliano

source: Purpose
sw: Madhumuni

source: District
sw: Wilaya

source: Error
sw: Hitilafu

# okButton
source: OK
sw: Sawa

# onlineMode
source: Online
sw: Mtandaoni

# offlineMode
source: Offline
sw: Nje ya mtandao

# usernameRequired
source: Username is required
sw: Jina la mtumiaji linahitajika

# passwordRequired
source: Password is required
sw: Nenosiri linahitajika

# connectionTimeout
source: Connection timed out. Please check your internet and try again.
sw: Muunganisho umekwisha muda. Tafadhali angalia intaneti yako na ujaribu tena.

# offlineNoCachedToken
source: No offline login available. Please connect to the internet.
sw: Hakuna uwezo wa kuingia bila mtandao. Tafadhali ungana na intaneti.

# offlineLoginSuccess
source: Successfully logged in offline
sw: Umefanikiwa kuingia bila mtandao

# offlineLoginHint
source: You are offline. Tap below to continue with your saved session
sw: Uko nje ya mtandao. Gusa hapa chini ili kuendelea na kikao chako kilichohifadhiwa

# invalidCredentials
source: Invalid username or password
sw: Jina la mtumiaji au nenosiri si sahihi

# adminNotAllowed
source: Administrators are not allowed to login here.
sw: Wasimamizi hawaruhusiwi kuingia hapa.

# streetLabel
source: Street
sw: Mtaa

# offlineBanner
source: You are offline
sw: Huna intaneti

# connectingBanner
source: Connecting...
sw: Inaunganisha...

# retryButton
source: RETRY
sw: JARIBU

# syncSuccess
source: Success!
sw: Mafanikio!

# syncReportsSubmitted
source: {count} reports submitted
sw: Ripoti {count} zimewekwa

# syncBookingsSubmitted
source: {count} bookings submitted
sw: Miadi {count} imewekwa

# syncReportNumber
source: Report #: {reportId}
sw: Nambari: {reportId}

# errorNoInternet
source: No internet connection. Please check your network.
sw: Hakuna mtandao. Tafadhali angalia muunganisho wako wa intaneti.

# errorServerIssue
source: Server error. Please try again later.
sw: Tatizo la seva. Tafadhali jaribu tena baadaye.

# errorTimeout
source: Request timed out. Network is slow, please try again.
sw: Muda umeisha. Mtandao unakuwa polepole, jaribu tena.

# errorAuth
source: Please sign in again to your account.
sw: Tafadhali ingia tena katika akaunti yako.

# errorGeneric
source: An error occurred. Please try again.
sw: Kuna tatizo. Tafadhali jaribu tena.

# errorOfflineSaved
source: You are offline. Data has been saved and will be synced when connection is restored.
sw: Mtandao haupo. Takwimu zimehifadhiwa na zitatumwa mara mtandao utakaporejesha.

# routeSearching
source: Finding route...
sw: Inatafuta njia...

source: Search location
sw: Tafuta eneo

# closeButton
source: CLOSE
sw: FUNGA

# requestTimeout
source: Request timed out. Please check your connection and try again.
sw: Muda umeisha. Tafadhali angalia muunganisho wako na ujaribu tena.

# syncReportsSuccess
source: {count} report(s) synced successfully
sw: Ripoti {count} zimesawazishwa kwa mafanikio

# syncBookingsSuccess
source: {count} booking(s) synced successfully
sw: Hifadhi {count} zimesawazishwa kwa mafanikio

# offline
source: No internet
sw: Huna intaneti

source: Reconnecting...
sw: Inaunganisha...

source: Retry
sw: Jaribu

# helpSupportTitle
source: Help & Support
sw: Msaada na Usaidizi

# needHelpTitle
source: Need Help?
sw: Unahitaji Msaada?

# needHelpSubtitle
source: Find answers to common questions or contact our support team.
sw: Pata majibu ya maswali ya kawaida au wasiliana na timu yetu ya usaidizi.

source: Hide Contact Form
sw: Ficha Fomu ya Mawasiliano

source: Contact Support
sw: Wasiliana na Usaidizi

# sendMessageTitle
source: Send us a message
sw: Tutumie ujumbe

# messageHint
source: Describe your issue or question in detail...
sw: Elezea tatizo au swali lako kwa undani...

# messageRequired
source: Please enter your message
sw: Tafadhali ingiza ujumbe wako

# messageTooShort
source: Please provide more details (at least 10 characters)
sw: Tafadhali toa maelezo zaidi (angalau herufi 10)

# messageSentTitle
source: Message Sent!
sw: Ujumbe Umetumwa!

# messageSentContent
source: Your message has been successfully sent to our support team. We will get back to you within 24-48 hours.
sw: Ujumbe wako umetumwa kwa timu yetu ya usaidizi. Tutakuja kwako ndani ya masaa 24-48.

# sendMessageButton
source: Send Message
sw: Tuma Ujumbe

# faqTitle
source: Frequently Asked Questions
sw: Maswali Yanayoulizwa Mara kwa Mara

# faqCategoryAccount
source: Account & Authentication
sw: Akaunti na Uthibitishaji

# faqQuestionResetPass
source: How do I reset my password?
sw: Je, ninawezaje kubadilisha nenosiri langu?

# faqAnswerResetPass
source: On the login screen, tap 'Forgot Password' and enter your registered email address. You will receive a password reset link via email. Follow the instructions in the email to create a new password.
sw: Kwenye skrini ya kuingia, gusa 'Umesahau Nenosiri' na ingiza barua pepe yako iliyosajiliwa. Utapokea kiungo cha kuweka upya nenosiri kupitia barua pepe. Fuata maelekezo kwenye barua pepe kuunda nenosiri jipya.

# faqQuestionAnonymous
source: Can I use the app without registering?
sw: Je, naweza kutumia programu bila kujisajili?

# faqAnswerAnonymous
source: Yes! You can browse and explore public spaces as an anonymous user. However, to report issues, book spaces, and track your activities, you'll need to create a registered account.
sw: Ndio! Unaweza kuvinjari na kuchunguza nafasi za umma kama mtumiaji asiyejulikana. Hata hivyo, ili kuripoti matatizo, kuhifadhi nafasi, na kufuatilia shughuli zako, utahitaji kuunda akaunti iliyosajiliwa.

# faqQuestionUpdateProfile
source: How do I update my profile information?
sw: Je, ninawezaje kusasisha taarifa zangu za wasifu?

# faqAnswerUpdateProfile
source: Go to your Profile page, tap the 'Edit Profile' button, update your information, and save your changes. Make sure to use a valid email address for important notifications.
sw: Nenda kwenye ukurasa wa Profaili yako, gusa kitufe cha 'Hariri Profaili', sasisha taarifa zako, na uhifadhi mabadiliko. Hakikisha unatumia barua pepe sahihi kwa arifa muhimu.

# faqCategoryReports
source: Reports & Bookings
sw: Ripoti na Hifadhi

# faqQuestionFindReports
source: Where can I find my submitted reports?
sw: Ninawezaje kupata ripoti zangu nilizowasilisha?

# faqAnswerFindReports
source: Navigate to your Profile page and select 'My Reports'. Here you can view all your submitted reports, track their progress, and see responses from authorities.
sw: Nenda kwenye ukurasa wa Profaili yako na chagua 'Ripoti Zangu'. Hapa unaweza kuona ripoti zako zote, kufuatilia maendeleo, na kuona majibu kutoka mamlaka.

# faqQuestionBookSpace
source: How do I book a public space?
sw: Je, ninawezaje kuhifadhi nafasi ya umma?

# faqAnswerBookSpace
source: Find the space you want on the Map or Home page, tap on it to view details, then click 'Book This Space'. Fill in the required information including date, time, and purpose, then submit your booking request.
sw: Tafuta nafasi unayotaka kwenye Ramani au ukurasa wa Nyumbani, gusa ili kuona maelezo, kisha bonyeza 'Hifadhi Nafasi Hii'. Jaza taarifa zinazohitajika ikiwemo tarehe, muda, na madhumuni, kisha tuma ombi lako la hifadhi.
