Repository: HeemTempo/v2
Catalog: lib/l10n/app_*.arb
Languages: sw

# faqQuestionCancelBooking
source: Can I cancel my booking?
sw: Je, naweza kughairi hifadhi yangu?

# faqAnswerCancelBooking
source: Yes, you can cancel bookings from the 'My Bookings' section in your profile. Please note that cancellations should be made at least 24 hours in advance when possible.
sw: Ndio, unaweza kughairi hifadhi kutoka sehemu ya 'Hifadhi Zangu' kwenye profaili yako. Tafadhali zingatia kuwa kufuta kunapaswa kufanywa angalau masaa 24 kabla ikiwezekana.

# faqQuestionReportResponse
source: How long does it take to get a response to my report?
sw: Inachukua muda gani kupata jibu la ripoti yangu?

# faqAnswerReportResponse
source: Response times vary depending on the severity and type of issue. Emergency issues are prioritized and typically addressed within 24-48 hours. General issues may take 3-7 business days.
sw: Muda wa kujibu hutofautiana kulingana na uzito na aina ya tatizo. Matatizo ya dharura hupewa kipaumbele na kushughulikiwa ndani ya masaa 24-48. Matatizo ya kawaida yanaweza kuchukua siku 3-7 za kazi.

# faqCategoryTechnical
source: Technical Support
sw: Usaidizi wa Kiufundi

# faqQuestionOffline
source: Does the app work offline?
sw: Je, programu inafanya kazi bila mtandao?

# faqAnswerOffline
source: Yes! The app supports offline functionality. You can view previously loaded content and submit reports/bookings offline. Your data will automatically sync when you're back online.
sw: Ndio! Programu inasaidia utendaji wa nje ya mtandao. Unaweza kuona maudhui yaliyopakiwa awali na kuwasilisha ripoti/hifadhi bila mtandao. Data yako itasawazishwa kiotomatiki utakapokuwa mtandaoni.

# faqQuestionLanguage
source: How do I change the app language?
sw: Je, ninawezaje kubadilisha lugha ya programu?

# faqAnswerLanguage
source: Go to Settings, select 'Language', and choose between English and Swahili. The app will update immediately to your selected language.
sw: Nenda kwenye Mipangilio, chagua 'Lugha', na chagua kati ya Kiingereza na Kiswahili. Programu itasasishwa mara moja kwa lugha uliyochagua.

# faqQuestionMapIssue
source: Why can't I see the map?
sw: Mbona siwezi kuona ramani?

# faqAnswerMapIssue
source: Make sure you have granted location permissions to the app and have an active internet connection for loading map data. Check your device settings if the issue persists.
sw: Hakikisha umetoa ruhusa ya eneo kwa programu na una mtandao mzuri kwa kupakia data ya ramani. Angalia mipangilio ya kifaa chako ikiwa tatizo litaendelea.

# faqQuestionCrash
source: What should I do if the app crashes?
sw: Nifanye nini ikiwa programu inajifunga yenyewe?

# faqAnswerCrash
source: Try closing and reopening the app. If the problem continues, clear the app cache from your device settings or reinstall the app. Contact support if the issue persists.
sw: Jaribu kufunga na kufungua tena programu. Ikiwa tatizo litaendelea, futa kache ya programu kwenye mipangilio ya kifaa au ingiza programu upya. Wasiliana na usaidizi ikiwa tatizo litaendelea.

source: Still need help?
sw: Bado unahitaji msaada?

# contactEmailLabel
source: Email
sw: Barua Pepe

# contactPhoneLabel
source: Phone
sw: Simu

# copyrightFooter
source: © 2026 Kinondoni Municipal Council
sw: © 2026 Baraza la Manispaa Kinondoni

# aboutTitle
source: About {appName}
sw: Kuhusu {appName}

# aboutMission
source: Our Mission
sw: Dhamira Yetu

# aboutMissionContent
source: OpenSpace App (OSA) is a community-driven platform designed to enhance public engagement in Kinondoni Municipality. Our mission is to empower citizens to report issues, book public spaces, and actively participate in improving their community.
sw: Programu ya OpenSpace (OSA) ni jukwaa linaloendeshwa na jamii lililoundwa kuboresha ushirikiano wa umma katika Manispaa ya Kinondoni. Dhamira yetu ni kuwawezesha wananchi kuripoti matatizo, kuhifadhi nafasi za umma, na kushiriki kikamilifu katika kuboresha jamii yao.

# aboutDeveloper
source: Developer
sw: Msanidi Programu

# aboutDeveloperValue
source: Kinondoni Municipal Council
sw: Baraza la Manispaa Kinondoni

# aboutLocation
source: Location
sw: Mahali

# aboutContact
source: Contact
sw: Mawasiliano

# aboutKeyFeatures
source: Key Features:
sw: Vipengele Muhimu:

# aboutFeature1
source: Report community issues with photos and location
sw: Ripoti changamoto za jamii ukiwa na picha na eneo

# aboutFeature2
source: Book public spaces and facilities
sw: Hifadhi nafasi na vifaa vya umma

# aboutFeature3
source: Track your reports and bookings
sw: Fuatilia ripoti na hifadhi zako

# aboutFeature4
source: Offline functionality for uninterrupted access
sw: Inafanya kazi bila mtandao kwa upatikanaji usioingiliwa

# aboutFeature5
source: Multi-language support (English & Swahili)
sw: Inasaidia lugha nyingi (Kiingereza na Kiswahili)

# aboutCopyright
source: © 2025 Kinondoni Municipal Council All rights reserved.
sw: © 2025 Baraza la Manispaa Kinondoni Haki zote zimehifadhiwa.

# termsUserResponsibilitiesTitle
source: 1. User Responsibilities
sw: 1. Majukumu ya Mtumiaji

# termsUserResponsibilitiesContent
source: You agree to use OpenSpace for lawful purposes, ensuring all reports and bookings are accurate and respectful of community spaces. Misuse, including false reporting or unauthorized access, may result in account suspension.
sw: Unakubali kutumia OpenSpace kwa madhumuni ya kisheria, ukihakikisha kuwa ripoti na hifadhi zote ni sahihi na zinaheshimu maeneo ya jamii. Matumizi mabaya, ikiwa ni pamoja na kutoa ripoti za uongo au ufikiaji usioidhinishwa, kunaweza kusababisha kusimamishwa kwa akaunti.

# termsAccountUsageTitle
source: 2. Account Usage
sw: 2. Matumizi ya Akaunti

# termsAccountUsageContent
source: Registered users must provide accurate information during sign-up, including a valid username and contact details. Anonymous users can explore public spaces but cannot access tracking features for reports or bookings.
sw: Watumiaji waliosajiliwa lazima watoe taarifa sahihi wakati wa kujisajili, ikiwa ni pamoja na jina la mtumiaji halali na maelezo ya mawasiliano. Watumiaji wasiojulikana wanaweza kuchunguza nafasi za umma lakini hawawezi kufikia vipengele vya kufuatilia ripoti au hifadhi.

# termsContentOwnershipTitle
source: 3. Content Ownership
sw: 3. Umiliki wa Maudhui

# termsContentOwnershipContent
source: Content submitted (e.g., issue reports, booking requests) may be used by OpenSpace to improve services, anonymized where necessary, in accordance with Tanzania's Personal Data Protection Act, 2022. Users retain ownership of their content but grant OpenSpace a non-exclusive license to use it for operational purposes.
sw: Maudhui yaliyowasilishwa (mfano: ripoti za changamoto, maombi ya hifadhi) yanaweza kutumiwa na OpenSpace kuboresha huduma, yakiwa hayajulikani mahali inapobidi, kwa mujibu wa Sheria ya Tanzania ya Ulinzi wa Data Binafsi, 2022. Watumiaji wanabaki na umiliki wa maudhui yao lakini wanaipa OpenSpace leseni isiyo ya kipekee ya kuitumia kwa madhumuni ya uendeshaji.

# termsLiabilityTitle
source: 4. Liability
sw: 4. Dhima

# termsLiabilityContent
source: OpenSpace is not liable for damages arising from misuse of the platform or inaccuracies in user-submitted data. Users are responsible for complying with local laws and platform policies.
sw: OpenSpace haiwajibiki kwa uharibifu unaotokana na matumizi mabaya ya jukwaa au kutokuwa na usahihi katika data iliyowasilishwa na watumiaji. Watumiaji wanawajibika kufuata sheria za nchi na sera za jukwaa.

# termsUpdatesTitle
source: 5. Updates to Terms
sw: 5. Maboresho ya Masharti

# termsUpdatesContent
source: We may update these terms periodically. Continued use of OpenSpace after updates constitutes acceptance. Notifications of changes will be provided via the app or official communication channels.
sw: Tunaweza kuboresha masharti haya mara kwa mara. Kuendelea kutumia OpenSpace baada ya maboresho kunamaanisha kukubali mabadiliko. Taarifa za mabadiliko zitatolewa kupitia programu au njia rasmi za mawasiliano.

# privacyDataCollectionTitle
source: 1. Data Collection
sw: 1. Ukusanyaji wa Data

# privacyDataCollectionContent
source: We collect minimal personal data (e.g., username, location for reports/bookings) to enable app functionality. Anonymous users' interactions are not linked to personal identifiers.
sw: Tunakusanya kiwango kidogo cha data binafsi (mfano: jina la mtumiaji, eneo kwa ajili ya ripoti/hifadhi) ili kuwezesha kazi za programu. Mawasiliano ya watumiaji wasiojulikana hayahusiani na vitambulisho binafsi.

# privacyDataUsageTitle
source: 2. Data Usage
sw: 2. Matumizi ya Data

# privacyDataUsageContent
source: Data is used to process reports, manage bookings, and enhance community services. Anonymized data may be shared with local authorities for urban planning and safety initiatives.
sw: Data inatumiwa kushughulikia ripoti, kusimamia hifadhi, na kuboresha huduma za jamii. Data isiyojulikana inaweza kushirikiwa na mamlaka za mitaa kwa ajili ya mipango miji na mipango ya usalama.

# privacyDataSecurityTitle
source: 3. Data Security
sw: 3. Usalama wa Data

# privacyDataSecurityContent
source: We employ encryption and secure protocols to protect registered users' credentials and data. Regular security audits ensure compliance with national regulations.
sw: Tunatumia usimbaji fiche na itifaki salama ili kulinda stakabadhi na data za watumiaji waliosajiliwa. Ukaguzi wa mara kwa mara wa usalama unahakikisha kufuata kanuni za kitaifa.

# privacyCookiesTitle
source: 4. Cookies and Analytics
sw: 4. Vidakuzi na Uchambuzi

# privacyCookiesContent
source: OpenSpace may use cookies or analytics tools to improve user experience. You can opt out via the Settings page. Analytics data is anonymized and used to optimize app performance.
sw: OpenSpace inaweza kutumia vidakuzi au zana za uchambuzi ili kuboresha hali ya matumizi ya mtumiaji. Unaweza kujiondoa kupitia ukurasa wa Mipangilio. Data ya uchambuzi haijulikani na inatumiwa kuboresha utendaji wa programu.

# privacyUserRightsTitle
source: 5. Your Rights
sw: 5. Haki Zako

# privacyUserRightsContent
source: You have the right to access, correct, or delete your personal data. Contact us via the Help & Support page. Requests for data access or deletion will be processed within 30 days, per regulatory requirements.
sw: Una haki ya kufikia, kusahihisha, au kufuta data yako binafsi. Wasiliana nasi kupitia ukurasa wa Msaada na Usaidizi. Maombi ya kufikia au kufuta data yatashughulikiwa ndani ya siku 30, kulingana na mahitaji ya kisheria.

# privacyInquiries
source: For further inquiries, contact support@openspace.go.tz or use the Help & Support page.
sw: Kwa maswali zaidi, wasiliana na support@openspace.go.tz au tumia ukurasa wa Msaada na Usaidizi.

# languageSelectSubtitle
source: Select your preferred language
sw: Chagua lugha unayopendelea

# languageEnglishDescription
source: Classic English language
sw: Lugha ya Kiingereza

# howToUseTitle
source: How to Use the App
sw: Jinsi ya Kutumia Programu

# offlineModeTitle
source: Offline Mode
sw: Hali ya Nje ya Mtandao

# offlineModeDescription
source: This app supports offline functionality to ensure you can access features even without internet connection.
sw: Programu hii inasaidia utendaji wa nje ya mtandao ili kuhakikisha unaweza kufikia vipengele hata bila muunganisho wa intaneti.

# firstTimeUseTitle
source: First Time Use
sw: Matumizi ya Mara ya Kwanza

# firstTimeUseDescription
source: When you first use the app, you need to be online to download and cache data (reports, bookings, open spaces). This allows you to access the information later when offline.
sw: Unapotumia programu kwa mara ya kwanza, unahitaji kuwa mtandaoni ili kupakua na kuhifadhi data (ripoti, hifadhi, nafasi za umma). Hii inakuruhusu kufikia taarifa baadaye bila mtandao.

# offlineAccessTitle
source: Offline Access
sw: Ufikiaji wa Nje ya Mtandao

# offlineAccessDescription
source: Once data is cached, you can view reports, bookings, and open spaces without internet. You can also submit new reports and bookings offline - they will be saved locally.
sw: Mara data imehifadhiwa, unaweza kuona ripoti, hifadhi, na nafasi za umma bila intaneti. Unaweza pia kuwasilisha ripoti na hifadhi mpya bila mtandao - zitahifadhiwa ndani.

# autoSyncTitle
source: Automatic Synchronization
sw: Usawazishaji Otomatiki

# autoSyncDescription
source: When your internet connection returns, the app automatically syncs all pending reports and bookings to the server. You'll see a notification when sync is complete.
sw: Muunganisho wako wa intaneti unaporejesha, programu inasawazisha ripoti na hifadhi zote zinazongoja kwenye seva kiotomatiki. Utaona arifa wakati usawazishaji umekamilika.

# offlineTipsTitle
source: Offline Tips
sw: Vidokezo vya Nje ya Mtandao

# offlineTip1
source: Always connect to internet at least once to download initial data
sw: Daima unganisha intaneti angalau mara moja ili kupakua data ya awali

# offlineTip2
source: Submitted reports/bookings while offline will show 'Pending' status
sw: Ripoti/hifadhi zilizowasilishwa bila mtandao zitaonyesha hali ya 'Inasubiri'

# offlineTip3
source: Pull down to refresh when online to get latest data
sw: Vuta chini ili kuonyesha upya unapokuwa mtandaoni ili kupata data mpya

# offlineTip4
source: Offline indicator appears in the app bar when no connection
sw: Kiashiria cha nje ya mtandao kinaonekana kwenye upau wa programu wakati hakuna muunganisho

# gotItButton
source: Got It!
sw: Nimeelewa!
